#!/usr/bin/env bash
#===============================================================================
#
#          FILE: iptables_manage.sh
# 
#         USAGE: ./iptables_manage.sh
# 
#   DESCRIPTION: 基于IPTABLES实现交互插入\删除INPUT链端口规则
# 
#  ORGANIZATION: dqzboy.com
#       CREATED: 2023
#===============================================================================

echo
cat << EOF
██████╗  ██████╗ ███████╗██████╗  ██████╗ ██╗   ██╗            ██████╗ ██████╗ ███╗   ███╗
██╔══██╗██╔═══██╗╚══███╔╝██╔══██╗██╔═══██╗╚██╗ ██╔╝           ██╔════╝██╔═══██╗████╗ ████║
██║  ██║██║   ██║  ███╔╝ ██████╔╝██║   ██║ ╚████╔╝            ██║     ██║   ██║██╔████╔██║
██║  ██║██║▄▄ ██║ ███╔╝  ██╔══██╗██║   ██║  ╚██╔╝             ██║     ██║   ██║██║╚██╔╝██║
██████╔╝╚██████╔╝███████╗██████╔╝╚██████╔╝   ██║       ██╗    ╚██████╗╚██████╔╝██║ ╚═╝ ██║
╚═════╝  ╚══▀▀═╝ ╚══════╝╚═════╝  ╚═════╝    ╚═╝       ╚═╝     ╚═════╝ ╚═════╝ ╚═╝     ╚═╝
                                                                                          
EOF

# 提示用户选择操作
echo "请选择要执行的操作："
echo "1. 添加端口"
echo "2. 删除端口"
read -e -p "请输入选项数字 (1/2): " choice

# 根据用户选择执行相应操作
if [ "$choice" == "1" ]; then
    # 添加端口规则
    read -e -p "请输入要添加的端口号: " port
    iptables -A INPUT -p tcp --dport "$port" -j ACCEPT
    echo "已添加端口 $port 到 INPUT 链"
elif [ "$choice" == "2" ]; then
    # 删除端口规则
    read -p "请输入要删除的端口号: " port
    iptables -D INPUT -p tcp --dport "$port" -j ACCEPT
    echo "已删除端口 $port 从 INPUT 链"
else
    echo "无效选项"
fi
